HirokiIshiguro/rx72n-envision-kit/phase8b/Projects/boot_loader_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2023-2024 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : r_fwup.c
 * Description  : Functions for the Firmware update module.
 **********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 20.07.2023 2.00    First Release
 *         : 29.09.2023 2.01    Fixed log messages.
 *                              Add parameter checking.
 *                              Added arguments to R_FWUP_WriteImageProgram API.
 *         : 28.03.2024 2.02    Update wrapper functions.
 *         : 09.04.2024 2.03    Fixed wrapper function.
 *         : 15.10.2024 2.04    Fixed wrapper function.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_fwup_if.h"
#include "r_fwup_private.h"
#include "r_fwup_wrap_com.h"
#include "r_fwup_wrap_flash.h"
#include "r_fwup_wrap_verify.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
#define FWUP_READ_BUF_SIZE                     (128U)
#define FWUP_COPY_BUF_SIZE                     (FWUP_CFG_CF_W_UNIT_SIZE)
#define FWUP_VERI_BUF_SIZE                     (128U)
#define FWUP_WRITE_HEADER_BUF_SIZE             (128U)
#define FWUP_IMAGE_FLAG                        (0xFEU)
#define FWUP_HASH_BYTES                        (32U)


/* Buffer area */
#if (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT)
#define FWUP_BUF_AREA_ADDR_L                   (FWUP_CFG_EXT_BUF_AREA_ADDR_L)
#define FWUP_BUF_AREA_BLK_SIZE                 (FWUP_CFG_EXT_BUF_AREA_BLK_SIZE)
#define FWUP_BUF_AREA_NUM_BLKS                 (FWUP_CFG_AREA_SIZE / FWUP_BUF_AREA_BLK_SIZE)
#else
#define FWUP_BUF_AREA_ADDR_L                   (FWUP_CFG_BUF_AREA_ADDR_L)
#define FWUP_BUF_AREA_BLK_SIZE                 (FWUP_CFG_CF_BLK_SIZE)
#define FWUP_BUF_AREA_NUM_BLKS                 (FWUP_CFG_AREA_SIZE / FWUP_BUF_AREA_BLK_SIZE)
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT) */

/* Data flash */
#define FWUP_DF_BLK_SIZE                       (FWUP_CFG_DF_BLK_SIZE)
#define FWUP_DF_NUM_BLKS                       (FWUP_CFG_DF_NUM_BLKS)
#define FWUP_DF_NUM_BYTES                      (FWUP_DF_BLK_SIZE * FWUP_DF_NUM_BLKS)

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
/*
 * functions
 */
static e_fwup_err_t check_initial_rcv (e_fwup_area_t area);
static bool check_magic_code (e_fwup_area_t area);
static uint32_t get_offset_from_install_area (uint32_t addr);
static bool check_addr_range (uint32_t addr);
static e_fwup_err_t write_image_header (e_fwup_area_t area, uint8_t **p_buf, uint32_t *p_bufsz, uint32_t hdr_size);
static e_fwup_err_t write_image_prog (e_fwup_area_t area, uint8_t *p_buf, uint32_t buf_size);
static e_fwup_err_t write_image_offset_prog (e_fwup_area_t area, uint8_t *p_buf, uint32_t offset, uint32_t buf_size);
static e_fwup_err_t erase_area (e_fwup_area_t area);
static e_fwup_err_t write_area (e_fwup_area_t area, uint8_t **p_buf, uint32_t *p_bufsz, uint32_t offset, uint32_t size);
static e_fwup_err_t write_area_offset (e_fwup_area_t area, uint8_t **p_buf, uint32_t *p_bufsz, uint32_t offset, uint32_t size, uint32_t *p_write_offset, uint32_t *p_write_size);
static void read_area (e_fwup_area_t area, uint32_t * p_buf, uint32_t area_offset, uint32_t size);
static e_fwup_err_t copy_to_main_area (void);
static int32_t sha256_update (e_fwup_area_t area, void * vp_ctx, uint32_t area_offset, uint32_t datalen);
static uint8_t * hash_sha256 (e_fwup_area_t area);
static uint32_t get_flash_write_addr(e_fwup_area_t area, uint32_t buf_sz_tmp, uint32_t rsu_offset, uint32_t *p_write_offset, uint32_t *p_write_address, uint32_t *p_write_size);

