HirokiIshiguro/rx72n-envision-kit/phase8b/Projects/boot_loader_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
    /* Parameter check. */
    if ((FWUP_AREA_MAIN != area) && (FWUP_AREA_BUFFER != area))
    {
        return (FWUP_ERR_FAILURE);
    }

    /* already exist header? */
    if (true == check_magic_code(area))
    {
        return (FWUP_SUCCESS);
    }

    if (FWUP_SIG_SIZE_MAX < sig_size)
    {
        return (FWUP_ERR_FAILURE);
    }

    /* Write to header */
    MEMCPY(p_hdr->magic_code, BOOT_LOADER_MAGIC_CODE, FWUP_MAGIC_CODE_LEN);
    p_hdr->image_flag = FWUP_IMAGE_FLAG;
    p_hdr->sig_size = sig_size;
    MEMCPY(p_hdr->sig_type, p_sig_type, STRLEN((const char FWUP_FAR *)p_sig_type));
    MEMCPY(p_hdr->sig, p_sig, sig_size);
    return (write_image_header(area, &p_buf_tmp, &bufsz_tmp, sizeof(buf)));
}
/**********************************************************************************************************************
 End of function R_FWUP_WriteImageHeader
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_WriteImageProgram
 * Description  : write image program
 * Arguments    : area             : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_buf            : Image program
 *                offset           : Offset from beginning of RSU file image
 *                buf_size         : buffer size
 * Return Value : FWUP_SUCCESS     : updated image program
 *                FWUP_PROGRESS    : need more image program data
 *                FWUP_ERR_FLASH   : flash write error
 *                FWUP_ERR_FAILURE : invalid parameter.
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_WriteImageProgram(e_fwup_area_t area, uint8_t *p_buf, uint32_t offset, uint32_t buf_size)
{
    /* Parameter check. */
    if ((FWUP_AREA_MAIN != area) && (FWUP_AREA_BUFFER != area))
    {
        return (FWUP_ERR_FAILURE);
    }
    return (write_image_offset_prog(area, p_buf, offset, buf_size));
}
/**********************************************************************************************************************
 End of function R_FWUP_WriteImageProgram
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_WriteImage
 * Description  : write image file
 * Arguments    : area             : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_buf            : User program data
 *                buf_size         : buffer size
 * Return Value : FWUP_SUCCESS     : updated image file
 *                FWUP_PROGRESS    : need more image file data
 *                FWUP_ERR_FLASH   : flash write error
 *                FWUP_ERR_FAILURE : invalid parameter
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_WriteImage(e_fwup_area_t area, uint8_t *p_buf, uint32_t buf_size)
{
    uint8_t *p_buf_tmp = p_buf;
    uint32_t bufsz_tmp = buf_size;
    e_fwup_area_t area_tmp;

    /* Parameter check. */
    if ((FWUP_AREA_MAIN != area) && (FWUP_AREA_BUFFER != area))
    {
        return (FWUP_ERR_FAILURE);
    }

#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
    area_tmp = FWUP_AREA_BUFFER;
#else
    area_tmp = area;
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */

    /* Initial receiving? */
    if (0 == s_initial_rcv_flg)
    {
        /* check magic code */
        if (0 != MEMCMP(p_buf, BOOT_LOADER_MAGIC_CODE, FWUP_MAGIC_CODE_LEN))
        {
            return (FWUP_ERR_FAILURE);
        }

        /* area erase */
        if (FWUP_SUCCESS != erase_area(area_tmp))
        {
            return (FWUP_ERR_FLASH);
        }
        s_initial_rcv_flg = 1;
    }

    /* Write image header */
    if (FWUP_ERR_FLASH == write_image_header(area_tmp, &p_buf_tmp, &bufsz_tmp, sizeof(st_fw_header_t)))
    {
        return (FWUP_ERR_FLASH);
    }

    /* Write image program */
    return (write_image_prog(area, p_buf_tmp, bufsz_tmp));
}
/**********************************************************************************************************************
 End of function R_FWUP_WriteImage
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_VerifyImage
 * Description  : verify image program
 * Arguments    : area             : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : FWUP_SUCCESS     : success
 *                FWUP_ERR_VERIFY  : validation failed
 *                FWUP_ERR_FAILURE : invalid parameter
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_VerifyImage(e_fwup_area_t area)
{
    uint8_t *p_hash;
    uint32_t buf[FWUP_VERI_BUF_SIZE / sizeof(uint32_t)];
    st_fw_header_t *p_hdr = (st_fw_header_t *)buf;

    /* Parameter check. */
    if ((FWUP_AREA_MAIN != area) && (FWUP_AREA_BUFFER != area))
    {
        return (FWUP_ERR_FAILURE);
    }

    /* Firmware verification for the signature type. */
    read_area(area, buf, 0, FWUP_VERI_BUF_SIZE);
    FWUP_LOG_DBG(MSG_VERIFY_INSTALL_AREA, (FWUP_AREA_MAIN == area) ? MSG_MAIN : MSG_BUFFER, p_hdr->sig_type);

    p_hash = hash_sha256(area);
    if (0 != r_fwup_wrap_verify_ecdsa(p_hash, p_hdr->sig_type, p_hdr->sig, p_hdr->sig_size))
    {
        FWUP_LOG_DBG(MSG_NG);
        return (FWUP_ERR_VERIFY);
    }

    FWUP_LOG_DBG(MSG_OK);
    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function R_FWUP_VerifyImage
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_ActivateImage
 * Description  : Activate New image program
 * Arguments    : None
 * Return Value : FWUP_SUCCESS     : success
 *                FWUP_ERR_FLASH   : flash error
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_ActivateImage(void)
{
#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
 #if (FWUP_CFG_FWUPV1_COMPATIBLE == 0)
    /* Bank swap. */
    return (r_fwup_wrap_bank_swap());
 #else
    return (FWUP_SUCCESS);
 #endif /* (FWUP_CFG_FWUPV1_COMPATIBLE == 0) */
#else
 #if (FWUP_CFG_FUNCTION_MODE == FWUP_FUNC_BOOTLOADER)
    /* Copy buffer area to main area. */
    return (copy_to_main_area());
 #else
    return (FWUP_SUCCESS);
 #endif
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */
}
/**********************************************************************************************************************
 End of function R_FWUP_ActivateImage
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_ExecImage
 * Description  : Execute image program
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void R_FWUP_ExecImage(void)
{
    uint32_t vect_addr;

    vect_addr = *(uint32_t*)(FWUP_CFG_MAIN_AREA_ADDR_L + (FWUP_CFG_AREA_SIZE - 4U));
    r_fwup_wrap_disable_interrupt();
    ((void (*)(void))vect_addr)();
}
/**********************************************************************************************************************
 End of function R_FWUP_ExecImage
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_SoftwareReset
 * Description  : Execute software reset.
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void R_FWUP_SoftwareReset(void)
{
    r_fwup_wrap_software_reset();
}
/**********************************************************************************************************************
 End of function R_FWUP_SoftwareReset
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_SoftwareDelay
 * Description  : Software delay timer
 * Arguments    : delay : delay count
 *                units : FWUP_DELAY_MICROSECS/FWUP_DELAY_MILLISECS/FWUP_DELAY_SECS
 * Return Value : 1     : success
 *                other : error
 *********************************************************************************************************************/
uint32_t R_FWUP_SoftwareDelay(uint32_t delay, e_fwup_delay_units_t units)
{
    return (r_fwup_wrap_software_delay(delay, units));
}
/**********************************************************************************************************************
 End of function R_FWUP_SoftwareDelay
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_GetVersion
 * Description  : Get r_fwup module version
 * Arguments    : None
 * Return Value : The version number is encoded where the top 2 bytes are the major version number
 *                and the bottom 2 bytes are the minor version number.
 *                For example, Version 4.25 would be returned as 0x00040019.
 *********************************************************************************************************************/
uint32_t R_FWUP_GetVersion(void)
{
    /* These version macros are defined in r_fwup_if.h. */
    return (((((uint32_t)FWUP_VERSION_MAJOR) << 16) | (uint32_t)FWUP_VERSION_MINOR));
}
/**********************************************************************************************************************
 End of function R_FWUP_GetVersion
 *********************************************************************************************************************/

