HirokiIshiguro/rx72n-envision-kit/phase8b/Projects/boot_loader_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
    /* Write descriptor */
    if (0 == s_prg_list_write_flg)
    {
        area_offset = sizeof(st_fw_header_t);
        ret_val = write_area(area_tmp, &p_buf_tmp, &buf_sz_tmp, sizeof(st_fw_header_t), sizeof(st_fw_desc_t));
        if (FWUP_SUCCESS != ret_val)
        {
            return (ret_val);
        }
        s_image_size += sizeof(st_fw_desc_t);

        /* get Image size */
        read_area(area_tmp, (uint32_t *)&dc, area_offset, sizeof(st_fw_desc_t));
        /* WAIT_LOOP */
        for (uint32_t i = 0; i < dc.n; i++)
        {
            /* write address in range? */
            if (false == check_addr_range(dc.fw[i].addr))
            {
                erase_area(area_tmp);
                return (FWUP_ERR_FLASH);
            }
            s_image_size += dc.fw[i].size;
        }

        /* Write flag is on */
        s_prg_list_write_flg = 1;

        /* IS there more buffer ? */
        if (0 == buf_sz_tmp)
        {
            return (FWUP_PROGRESS);
        }
    }

    /* write user program */
    if (0 == s_img_prog_write_flg)
    {
        /* WAIT_LOOP */
        while(1)
        {
            /* Get N, addr, size */
            area_tmp_bak = area_tmp;
            read_area(area_tmp, (uint32_t *)&dc, sizeof(st_fw_header_t), sizeof(st_fw_desc_t));
            if ((FWUP_CFG_DF_ADDR_L <= dc.fw[fw_cnt].addr) &&
                (dc.fw[fw_cnt].addr < (FWUP_CFG_DF_ADDR_L + FWUP_DF_NUM_BYTES)))
            {
                /* DF*/
                area_offset = dc.fw[fw_cnt].addr - FWUP_CFG_DF_ADDR_L;
                area_tmp = FWUP_AREA_DATA_FLASH;
            }
            else
            {
                /* CF : Flash address -> install area offset */
                area_offset = get_offset_from_install_area(dc.fw[fw_cnt].addr);
#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
                area_tmp = FWUP_AREA_BUFFER;
#else
                area_tmp = area;
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */
            }

            ret_val = write_area(area_tmp, &p_buf_tmp, &buf_sz_tmp, area_offset, dc.fw[fw_cnt].size);
            if ((FWUP_SUCCESS != ret_val) && (FWUP_PROGRESS != ret_val))
            {
                FWUP_LOG_ERR(
                    "write_image_prog failed: fw_cnt=%u area=%u fw_addr=0x%08lx area_offset=0x%08lx segment_size=%lu ret=%d wrote=%lu bufsz=%lu\r\n",
                    fw_cnt,
                    area_tmp,
                    dc.fw[fw_cnt].addr,
                    area_offset,
                    dc.fw[fw_cnt].size,
                    ret_val,
                    s_wrote_counter,
                    buf_sz_tmp);
                return (ret_val);
            }

            /* Next part */
            if (++fw_cnt >= dc.n)
            {
                s_img_prog_write_flg = 1;
                break;
            }

            /* IS there buffer to write ? */
            if (0 == buf_sz_tmp)
            {
                return (FWUP_PROGRESS);
            }
            area_tmp = area_tmp_bak;
        }
    }

    if (1 == s_img_prog_write_flg)
    {
        s_image_size = 0;
        s_initial_rcv_flg = 0;
        s_img_header_write_flg = 0;
        s_prg_list_write_flg = 0;
        s_img_prog_write_flg = 0;
    }
    return (ret_val);
}
/**********************************************************************************************************************
 End of function write_image_prog
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_image_offset_prog
 * Description  : write image header from received buffer
 * Arguments    : area             : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_buf            : Image program
 *                offset           : offset
 *                buf_size         : buffer size
 * Return Value : FWUP_SUCCESS     : updated image program
 *                FWUP_PROGRESS    : need more image program data
 *                FWUP_ERR_FLASH   : flash write error
 *                FWUP_ERR_FAILURE : invalid parameter
 *********************************************************************************************************************/
static e_fwup_err_t write_image_offset_prog(e_fwup_area_t area, uint8_t *p_buf, uint32_t offset, uint32_t buf_size)
{
    e_fwup_err_t ret_val = FWUP_PROGRESS;
    uint8_t *p_buf_tmp = p_buf;
    uint32_t buf_sz_tmp = buf_size;
    st_fw_desc_t dc;
    e_fwup_area_t area_tmp = area;
    e_fwup_area_t area_tmp_bak;
    static uint8_t fw_cnt = 0;
    uint32_t area_offset;
    uint32_t rsu_offset = 0;
    uint32_t write_offset = 0;
    uint32_t write_address;
    uint32_t write_size = 0;

#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
    area_tmp = FWUP_AREA_BUFFER;
#else
    area_tmp = area;
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */

    /* No buffer */
    if (0 == buf_size)
    {
        return (FWUP_PROGRESS);
    }

    if (FWUP_SUCCESS != check_initial_rcv(area_tmp))
    {
        return (FWUP_ERR_FLASH);
    }

    /* Write descriptor */
    if (0 == s_prg_list_write_flg)
    {
        if (offset != sizeof(st_fw_header_t))
        {
            return (FWUP_ERR_FAILURE);
        }
        area_offset = sizeof(st_fw_header_t);
        write_offset = 0;
        ret_val = write_area_offset(area_tmp, &p_buf_tmp, &buf_sz_tmp, area_offset, sizeof(st_fw_desc_t), &write_offset, &write_size);
        write_offset = 0;

        if (FWUP_SUCCESS != ret_val)
        {
            return (ret_val);
        }
        s_image_size += sizeof(st_fw_desc_t);

        /* get Image size */
        read_area(area_tmp, (uint32_t *)&dc, area_offset, sizeof(st_fw_desc_t));
        /* WAIT_LOOP */
        for (uint32_t i = 0; i < dc.n; i++)
        {
            /* write address in range? */
            if (false == check_addr_range(dc.fw[i].addr))
            {
                erase_area(area_tmp);
                return (FWUP_ERR_FLASH);
            }
            s_image_size += dc.fw[i].size;
        }
        /* Write flag is on */
        s_prg_list_write_flg = 1;

        /* Set rsu_offset to the beginning of the user program. */
        rsu_offset = 0;

        /* IS there more buffer ? */
        if (0 == buf_sz_tmp)
        {
            return (FWUP_PROGRESS);
        }
    }

    /* write user program */
    if (0 == s_img_prog_write_flg)
    {
        /* offset < 0x200 */
        if (offset < sizeof(st_fw_header_t))
        {
            return (FWUP_ERR_FAILURE);
        }
        /* 0x200 < offset < 0x300 */
        if ((offset > sizeof(st_fw_header_t)) && (offset < (sizeof(st_fw_header_t) + sizeof(st_fw_desc_t))))
        {
            return (FWUP_ERR_FAILURE);
        }
        /* The following processing assumes an offset of 0x200 or 0x300 or higher. */
        if (offset != sizeof(st_fw_header_t))
        {
            rsu_offset = offset - sizeof(st_fw_header_t) - sizeof(st_fw_desc_t);
        }
        /* Get N, addr, size */
        area_tmp_bak = area_tmp;
        read_area(area_tmp, (uint32_t *)&dc, sizeof(st_fw_header_t), sizeof(st_fw_desc_t));
        fw_cnt = get_flash_write_addr(area_tmp, buf_sz_tmp, rsu_offset, &write_offset, &write_address, &write_size);
        if (fw_cnt < FWUP_IMAGE_BLOCKS)
        {
            if ((FWUP_CFG_DF_ADDR_L <= write_address) &&
                (write_address < (FWUP_CFG_DF_ADDR_L + FWUP_DF_NUM_BYTES)))
            {
                /* DF*/
                area_offset = write_address - FWUP_CFG_DF_ADDR_L;
                area_tmp = FWUP_AREA_DATA_FLASH;
            }
            else
            {
                /* CF : Flash address -> install area offset */
                area_offset = get_offset_from_install_area(write_address);
#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
                area_tmp = FWUP_AREA_BUFFER;
#else
                area_tmp = area;
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */
            }
            ret_val = write_area_offset(area_tmp, &p_buf_tmp, &buf_sz_tmp, area_offset, dc.fw[fw_cnt].size, &write_offset, &write_size);
            if (FWUP_ERR_FLASH == ret_val)
            {
                FWUP_LOG_ERR(
                    "write_image_offset_prog failed: fw_cnt=%u area=%u write_address=0x%08lx area_offset=0x%08lx write_offset=0x%08lx chunk=%lu total=%lu\r\n",
                    fw_cnt,
                    area_tmp,
                    write_address,
                    area_offset,
                    write_offset,
                    write_size,
                    dc.fw[fw_cnt].size);
                return (ret_val);
            }
            if ((FWUP_SUCCESS == ret_val) || (FWUP_PROGRESS == ret_val))
            {
                /* IS there buffer to write ? */
                if (0 == buf_sz_tmp)
                {
                    if (s_image_size <= s_write_current_size)
                    {
                        s_img_prog_write_flg = 1;
                        s_image_size = 0;
                        s_initial_rcv_flg = 0;
                        s_prg_list_write_flg = 0;
                        s_img_prog_write_flg = 0;
                        s_write_current_size = 0;
                        return (FWUP_SUCCESS);
                    }
                    else
                    {
                        return (FWUP_PROGRESS);
                    }
                }
                else
                {
                    /* Next part */
                    if (++fw_cnt >= dc.n)
                    {
                        return (FWUP_ERR_FAILURE);
                    }
                }
                area_tmp = area_tmp_bak;
            }
        }
        else
        {
            return (FWUP_ERR_FAILURE);
        }

        /* WAIT_LOOP */
        while(1)
        {
            /* Get N, addr, size */
            area_tmp_bak = area_tmp;
            read_area(area_tmp, (uint32_t *)&dc, sizeof(st_fw_header_t), sizeof(st_fw_desc_t));
            if ((FWUP_CFG_DF_ADDR_L <= dc.fw[fw_cnt].addr) &&
                (dc.fw[fw_cnt].addr < (FWUP_CFG_DF_ADDR_L + FWUP_DF_NUM_BYTES)))
            {
                /* DF*/
                area_offset = dc.fw[fw_cnt].addr - FWUP_CFG_DF_ADDR_L;
                area_tmp = FWUP_AREA_DATA_FLASH;
            }
            else
            {
                /* CF : Flash address -> install area offset */
                if (dc.fw[fw_cnt].size >= buf_sz_tmp)
                {
                    write_size = buf_sz_tmp;
                }
                else
                {
                    write_size = dc.fw[fw_cnt].size;
                }
                write_address = dc.fw[fw_cnt].addr + write_offset;
                area_offset = get_offset_from_install_area(write_address);
#if (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK)
                area_tmp = FWUP_AREA_BUFFER;
#else
                area_tmp = area;
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_DUAL_BANK) */
            }
            ret_val = write_area_offset(area_tmp, &p_buf_tmp, &buf_sz_tmp, area_offset, dc.fw[fw_cnt].size, &write_offset, &write_size);
            if ((FWUP_SUCCESS == ret_val) || (FWUP_PROGRESS == ret_val))
            {
                /* IS there buffer to write ? */
                if (0 == buf_sz_tmp)
                {
                    if (s_image_size <= s_write_current_size)
                    {
                        s_img_prog_write_flg = 1;
                        ret_val = FWUP_SUCCESS;
                    }
                    else
                    {
                        ret_val = FWUP_PROGRESS;
                    }
                    break;
                }
                else
                {
                    /* Next part */
                    if (++fw_cnt >= dc.n)
                    {
                        return (FWUP_ERR_FAILURE);
                    }
                }
            }
            else
            {
                FWUP_LOG_ERR(
                    "write_image_offset_prog failed: fw_cnt=%u area=%u write_address=0x%08lx area_offset=0x%08lx write_offset=0x%08lx chunk=%lu total=%lu ret=%d\r\n",
                    fw_cnt,
                    area_tmp,
                    write_address,
                    area_offset,
                    write_offset,
                    write_size,
                    dc.fw[fw_cnt].size,
                    ret_val);
                return (ret_val);
            }
            area_tmp = area_tmp_bak;
        }
    }

