HirokiIshiguro/rx72n-envision-kit/phase8b/Projects/boot_loader_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
    /* Erase main area */
    if (FWUP_SUCCESS != erase_area(FWUP_AREA_MAIN))
    {
        return (FWUP_ERR_FLASH);
    }

    /* Copy to main area */
    max_cnt = (FWUP_CFG_AREA_SIZE / FWUP_COPY_BUF_SIZE);
    /* WAIT_LOOP */
    for (block_cnt = 0; max_cnt > block_cnt; block_cnt++)
    {
        /* Read firmware from buffer area */
        read_area(FWUP_AREA_BUFFER, cf_block, read_addr, FWUP_COPY_BUF_SIZE);

        /* Write firmware to main area */
        if (FWUP_SUCCESS !=
                r_fwup_wrap_flash_write((uint32_t) cf_block,
                                        (uint32_t) (FWUP_CFG_MAIN_AREA_ADDR_L + (FWUP_COPY_BUF_SIZE * block_cnt)),
                                        FWUP_COPY_BUF_SIZE))
        {
            return (FWUP_ERR_FLASH);
        }
        read_addr += FWUP_COPY_BUF_SIZE;
    }

    /* Erase buffer area */
    return (erase_area(FWUP_AREA_BUFFER));
#else
    return (FWUP_SUCCESS);
#endif /* (FWUP_CFG_UPDATE_MODE != FWUP_DUAL_BANK) */
}
/**********************************************************************************************************************
 End of function copy_to_main_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: sha256_update
 * Description  : calculate SHA256 hash of designated install area. (MAIN_AREA or BUFFER_AREA)
 * Arguments    : area        : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
 *                vp_ctx      : crypt library's context
 *                area_offset : offset in area
 *                datalen     : data length
 * Return Value : none.
 *********************************************************************************************************************/
static int32_t sha256_update(e_fwup_area_t area, void * vp_ctx, uint32_t area_offset, uint32_t datalen)
{
    uint32_t rbuf[FWUP_READ_BUF_SIZE / sizeof(uint32_t)];
    uint32_t rbuf_size = FWUP_READ_BUF_SIZE;
    uint32_t area_offset_tmp = area_offset;

    /* WAIT_LOOP */
    while (datalen > 0)
    {
        if (datalen < rbuf_size)
        {
            rbuf_size = datalen;
        }

        /* Read flash */
        read_area(area, (uint32_t *)rbuf, area_offset_tmp, rbuf_size);
        r_fwup_wrap_sha256_update(vp_ctx, (C_U8_FAR *)rbuf, rbuf_size);

        area_offset_tmp += rbuf_size;
        datalen -= rbuf_size;
    }
    return (0);
}
/**********************************************************************************************************************
 End of function sha256_update
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: hash_sha256
 * Description  : calculate SHA256 hash on main area / buffer area.
 * Arguments    : area    : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : pointer of hash data.
 *********************************************************************************************************************/
static uint8_t * hash_sha256(e_fwup_area_t area)
{
    static uint8_t puc_hash[FWUP_HASH_BYTES];
    uint32_t area_offset;
    st_fw_desc_t dc;
    void * vp_ctx = r_fwup_wrap_get_crypt_context();

    r_fwup_wrap_sha256_init(vp_ctx);

    /* Read N, addr, size from update list */
    area_offset = sizeof(st_fw_header_t);
    read_area(area, (uint32_t *)&dc, area_offset, sizeof(st_fw_desc_t));

    /* update list */
    sha256_update(area, vp_ctx, area_offset, sizeof(st_fw_desc_t));

    /* program code */
    /* WAIT_LOOP */
    for (uint8_t cnt = 0; cnt < dc.n; cnt++)
    {
        if ((FWUP_CFG_DF_ADDR_L <= dc.fw[cnt].addr) && (dc.fw[cnt].addr < (FWUP_CFG_DF_ADDR_L + FWUP_DF_NUM_BYTES)))
        {
            /* Data flash */
            sha256_update(FWUP_AREA_DATA_FLASH, vp_ctx, dc.fw[cnt].addr, dc.fw[cnt].size);
        }
        else
        {
            /* Code flash */
            area_offset =  get_offset_from_install_area(dc.fw[cnt].addr);
            sha256_update(area, vp_ctx, area_offset, dc.fw[cnt].size);
        }
    }
    r_fwup_wrap_sha256_final(puc_hash, vp_ctx);
    return (puc_hash);
}
/**********************************************************************************************************************
 End of function hash_sha256
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: get_flash_write_addr
* Description  : Get flash write start address, offset from write start address, write size, descriptor index from rsu_offset.
* Arguments    : area                : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
*                p_buf:(i/o)         : (i)image data's pointer ,  (o)left buffer
*                buf_sz_tmp          :   buffer size
*                rsu_offset          : Offset from the start address of the user program following Descriptor.
*                p_write_offset:(o)  : Indicates the offset from Start Address[X].
*                p_write_address:(o) : write start address.
*                p_write_size:(o)    : Write size is Data Size[X] minus write_offset.
* Return Value : dc_index            : Descriptor index
**********************************************************************************************************************/
static uint32_t get_flash_write_addr(e_fwup_area_t area, uint32_t buf_sz_tmp, uint32_t rsu_offset, uint32_t *p_write_offset, uint32_t *p_write_address, uint32_t *p_write_size)
{
    uint32_t dc_index = FWUP_IMAGE_BLOCKS;
    uint32_t rsu_index;
    st_fw_desc_t dc;

    rsu_index = 0;

    /* Get N, addr, size */
    read_area(area, (uint32_t *)&dc, sizeof(st_fw_header_t), sizeof(st_fw_desc_t));
    /* WAIT_LOOP */
    for (uint32_t cnt = 0; cnt < dc.n; cnt++)
    {
        if ((rsu_index + dc.fw[cnt].size) >= rsu_offset)
        {
            if ((rsu_index + dc.fw[cnt].size) == rsu_offset)
            {
                *p_write_offset = 0;
                if ((cnt + 1) < dc.n)
                {
                    cnt++;
                }
            }
            else
            {
                *p_write_offset = rsu_offset - rsu_index;
            }
            if (dc.fw[cnt].size > (*p_write_offset + buf_sz_tmp))
            {
                *p_write_size = buf_sz_tmp;
            }
            else
            {
                *p_write_size = dc.fw[cnt].size - *p_write_offset;
            }
            *p_write_address = dc.fw[cnt].addr + *p_write_offset;
            dc_index = cnt;
            break;
        }
        rsu_index += dc.fw[cnt].size;
    }
    return dc_index;

