HirokiIshiguro/rx72n-envision-kit/phase8b/Projects/boot_loader_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_fwup/src/r_fwup.c
}
/**********************************************************************************************************************
 End of function get_flash_write_addr
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_area_offset
 * Description  : Write firmware data to designated area.
 * Arguments    : area               : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
 *                p_buf:(i/o)        : (i)image data's pointer ,  (o)left buffer
 *                p_bufsz:(i/o)      : (i)buffer size,            (o)left buffer size
 *                offset             : write offset from install area. (not flash address!!!)
 *                size               : write size
 *                p_write_offset:(o) : Indicates the offset from Start Address[X].
 *                p_write_size:(o)   : Write size is Data Size[X] minus write_offset.
 * Return Value : FWUP_SUCCESS       : done     (enough buffer)
 *                FWUP_PROGRESS      : progress (not enough buffer)
 *                FWUP_ERR_FLASH     : flash write error
 *********************************************************************************************************************/
static e_fwup_err_t write_area_offset(e_fwup_area_t area, uint8_t **p_buf,
                               uint32_t *p_bufsz, uint32_t offset, uint32_t size, uint32_t *p_write_offset, uint32_t *p_write_size)
{
    uint32_t start_addr = FWUP_CFG_MAIN_AREA_ADDR_L + offset;
    e_fwup_err_t (*pfunc)(uint32_t, uint32_t, uint32_t) = r_fwup_wrap_flash_write;

    if (FWUP_AREA_BUFFER == area)
    {
        pfunc = FWUP_FUNC_BUFFER_AREA_WRITE;
        start_addr = FWUP_BUF_AREA_ADDR_L + offset;
    }
    else if (FWUP_AREA_DATA_FLASH == area)
    {
        start_addr = FWUP_CFG_DF_ADDR_L + offset;
    }
    else
    {
        ; /* Do nothing */
    }

    /* Is buffer enough? */
    if (size > (*p_write_offset + (*p_bufsz)))
    {
        /* not enough */
        *p_write_size = *p_bufsz;
    }
    else
    {
        /* enough */
        *p_write_size = size - *p_write_offset;
    }

    /* Write firmware */
    if (FWUP_SUCCESS != pfunc((uint32_t)*p_buf, start_addr, *p_write_size))
    {
        return (FWUP_ERR_FLASH);
    }
    FWUP_LOG_DBG(MSG_WRITE_OK, start_addr, *p_write_size);
    s_write_current_size += *p_write_size;

    *p_buf += *p_write_size;
    *p_bufsz -= *p_write_size;
    if (size > *p_write_offset + *p_write_size )
    {
        return (FWUP_PROGRESS);
    }
    *p_write_offset = 0;
    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function write_area_offset
 *********************************************************************************************************************/

